jmeter/test-result/3-jersey-microservice-jdbc/statistics.json
{
  "UpdateActivationRecord - 信用卡開卡 更新信用卡狀態" : {
    "transaction" : "UpdateActivationRecord - 信用卡開卡 更新信用卡狀態",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33.8233333333333,
    "medianResTime" : 33.0,
    "minResTime" : 29.0,
    "maxResTime" : 71.0,
    "pct1ResTime" : 37.900000000000034,
    "pct2ResTime" : 41.0,
    "pct3ResTime" : 51.960000000000036,
    "throughput" : 2.3862551702195356,
    "receivedKBytesPerSec" : 0.6058851018135539,
    "sentKBytesPerSec" : 0.7387137587496023
  },
  "InsertBill - 產生各消費者的月結帳單" : {
    "transaction" : "InsertBill - 產生各消費者的月結帳單",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.066666666666674,
    "medianResTime" : 28.0,
    "minResTime" : 16.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 31.94999999999999,
    "pct3ResTime" : 33.0,
    "throughput" : 2.3866158582668393,
    "receivedKBytesPerSec" : 0.5780085281740003,
    "sentKBytesPerSec" : 1.9484481030381622
  },
  "FindCusBill - 查詢該月帳單的所有客戶資料" : {
    "transaction" : "FindCusBill - 查詢該月帳單的所有客戶資料",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.966666666666676,
    "medianResTime" : 27.0,
    "minResTime" : 14.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 29.0,
    "pct3ResTime" : 31.99000000000001,
    "throughput" : 2.387945650356998,
    "receivedKBytesPerSec" : 1.5227817477374215,
    "sentKBytesPerSec" : 0.5503468491057143
  },
  "GetActivatedCardHolder - 查詢有效卡片持有者資料" : {
    "transaction" : "GetActivatedCardHolder - 查詢有效卡片持有者資料",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 29.42333333333333,
    "medianResTime" : 29.0,
    "minResTime" : 26.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 34.99000000000001,
    "throughput" : 2.3863690599296814,
    "receivedKBytesPerSec" : 2.2884906414560033,
    "sentKBytesPerSec" : 0.7317577000175001
  },
  "FindCusBillAll - 查詢該月帳單的\"特定\"客戶資料" : {
    "transaction" : "FindCusBillAll - 查詢該月帳單的\"特定\"客戶資料",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 71.32666666666661,
    "medianResTime" : 66.0,
    "minResTime" : 55.0,
    "maxResTime" : 182.0,
    "pct1ResTime" : 90.90000000000003,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 165.73000000000025,
    "throughput" : 2.386444992442924,
    "receivedKBytesPerSec" : 2277.9293301547214,
    "sentKBytesPerSec" : 0.7108063698194257
  },
  "InsertCusDateBill - 客戶使用信用卡消費計入消費紀錄" : {
    "transaction" : "InsertCusDateBill - 客戶使用信用卡消費計入消費紀錄",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.18666666666665,
    "medianResTime" : 27.0,
    "minResTime" : 24.0,
    "maxResTime" : 37.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 33.99000000000001,
    "throughput" : 2.388173763523034,
    "receivedKBytesPerSec" : 0.594711239939818,
    "sentKBytesPerSec" : 1.5649068313710506
  },
  "CreateCuscredit - 新增客戶信用卡資訊" : {
    "transaction" : "CreateCuscredit - 新增客戶信用卡資訊",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.526666666666674,
    "medianResTime" : 24.0,
    "minResTime" : 19.0,
    "maxResTime" : 77.0,
    "pct1ResTime" : 31.900000000000034,
    "pct2ResTime" : 34.0,
    "pct3ResTime" : 54.840000000000146,
    "throughput" : 2.3853823767950004,
    "receivedKBytesPerSec" : 0.5893571692667334,
    "sentKBytesPerSec" : 2.2246486033586184
  },
  "UpdateDisputedFlag - 爭議款項申請:上註記" : {
    "transaction" : "UpdateDisputedFlag - 爭議款項申請:上註記",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.20333333333333,
    "medianResTime" : 13.0,
    "minResTime" : 10.0,
    "maxResTime" : 27.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 20.0,
    "throughput" : 2.386995647711269,
    "receivedKBytesPerSec" : 0.5967489119278173,
    "sentKBytesPerSec" : 0.7436050894725535
  },
  "FindCusBill - 本期信用卡帳單查詢" : {
    "transaction" : "FindCusBill - 本期信用卡帳單查詢",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.503333333333355,
    "medianResTime" : 25.0,
    "minResTime" : 21.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 27.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 29.99000000000001,
    "throughput" : 2.3866918064870286,
    "receivedKBytesPerSec" : 2.3960148213561183,
    "sentKBytesPerSec" : 0.6502802871190243
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 29.601944444444417,
    "medianResTime" : 28.0,
    "minResTime" : 10.0,
    "maxResTime" : 182.0,
    "pct1ResTime" : 36.0,
    "pct2ResTime" : 64.0,
    "pct3ResTime" : 87.98999999999978,
    "throughput" : 19.871058906650184,
    "receivedKBytesPerSec" : 1589.3855470129934,
    "sentKBytesPerSec" : 8.606264282323588
  },
  "GetCardHolder - 查詢卡片持有者資料" : {
    "transaction" : "GetCardHolder - 查詢卡片持有者資料",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 29.166666666666668,
    "medianResTime" : 29.0,
    "minResTime" : 26.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 36.99000000000001,
    "throughput" : 2.386426008861595,
    "receivedKBytesPerSec" : 2.2675708072483713,
    "sentKBytesPerSec" : 0.6129199612603511
  },
  "UpdatePayDate - 繳交信用卡費" : {
    "transaction" : "UpdatePayDate - 繳交信用卡費",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.656666666666679,
    "medianResTime" : 15.0,
    "minResTime" : 11.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 19.900000000000034,
    "pct2ResTime" : 21.0,
    "pct3ResTime" : 31.960000000000036,
    "throughput" : 2.3866348448687353,
    "receivedKBytesPerSec" : 0.5780131264916467,
    "sentKBytesPerSec" : 0.8343899164677804
  },
  "UpdateCardApprovalStatus - 審核信用卡 更新信用卡狀態" : {
    "transaction" : "UpdateCardApprovalStatus - 審核信用卡 更新信用卡狀態",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 29.37333333333335,
    "medianResTime" : 29.0,
    "minResTime" : 26.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 33.0,
    "pct3ResTime" : 37.0,
    "throughput" : 2.386274151082971,
    "receivedKBytesPerSec" : 0.6105506128747445,
    "sentKBytesPerSec" : 1.092932203962806
  }
}